
const re = "aren't 'сaren'tере 'следующем примере следующем примере 'следующем примере 'следующем примере следующем примере следующем примере 'следующем примере 'следующем примере следующем примере 'следующем примере 'следующем примере следующем примереследующем примере 'следующем примере 'следующем примере следующем примере 'следующем примере 'следующем примере следующем примереследующем примере 'следующем примере 'следующем примере следующем примере 'следующем примере 'следующем примере следующем примереследующем примере 'следующем примере 'следующем примере следующем примере 'следующем примере 'следующем примере следующем примереследующем примере 'следующем примере 'следующем примере следующем примере 'следующем примере 'следующем примере следующем примереследующем примере 'следующем примере 'следующем примере следующем примере 'следующем примере 'следующем примере следующем примереследующем примере 'следующем примере 'следующем примере следующем примере 'следующем примере 'следующем примере следующем примереследующем примере 'следующем примере 'следующем примере следующем примере 'следующем примере 'следующем примере следующем примереследующем примере 'следующем примере 'следующем примере следующем примере 'следующем примере 'следующем примере следующем примереследующем примере 'следующем примере 'следующем примере следующем примере 'следующем примере 'следующем примере следующем примереследующем примере 'следующем примере 'следующем примере следующем примере 'следующем примере 'следующем примере следующем примере"
re.replace(/'\B/g, '"'); // Заменяет все одинарные ковычки на двойные, исключая случаев не на границе слов.

const form = document.querySelector('.form')
const btn = form.querySelector('btn')

form.addEventListener('submit', function () {
    console.log('clicked on validate')
})

function validateName(name) {
    var regName = /^[А-ЯЁ][а-яё]+$/g;
    return regName.test(name);
}

function validateEmail(email) {
    var regEm = /[-.\w]+@([\w-]+\.)+[\w-]+/g;
    return regEm.test(email);
}
function validateNumber(number) {
    var regNum = /[+7][-\(]\d{3}[-\)]\d{3}-\d{4}/g;
    return regNum.test(number);
}


